In [1]:
import numpy as np
import pandas as pd

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

#### Filtering
* Pandas'ta filtreleme mantığı numpy'da gördüğümüz filtreleme mantığı ile paralel olacak

In [4]:
df = pd.read_csv("student.csv")

In [5]:
df.set_index("number", inplace=True)

In [6]:
df["lastName"]

number
401    Kolamuc
303    Ronaldo
105      Engin
216    Aydınus
Name: lastName, dtype: object

In [7]:
df["lastName"] == "Ronaldo"

number
401    False
303     True
105    False
216    False
Name: lastName, dtype: bool

In [10]:
filt = (df["age"] < 40)

In [11]:
df[filt]

             name lastName  age
number
401       Alperen  Kolamuc   18
303     Cristiano  Ronaldo   35

#### Filtering - Belirli Column(lara) Ulaşmak

In [12]:
df

             name lastName  age
number
401       Alperen  Kolamuc   18
303     Cristiano  Ronaldo   35
105         Sinan    Engin   48
216         Fırat  Aydınus   42

In [13]:
filt = (df["lastName"] == "Ronaldo")
df.loc[filt, "name"]

number
303    Cristiano
Name: name, dtype: object

#### Opposite Filter

In [14]:
df

             name lastName  age
number
401       Alperen  Kolamuc   18
303     Cristiano  Ronaldo   35
105         Sinan    Engin   48
216         Fırat  Aydınus   42

In [15]:
filt = ~((df["name"] == "Sinan") | (df["lastName"] == "Engin"))

In [16]:
df.loc[filt, ["age","name"]]

        age       name
number
401      18    Alperen
303      35  Cristiano
216      42      Fırat